видео: 	https://youtu.be/YjfwVaKYdOo
	https://youtu.be/Qyk6cBE91QY
	https://youtu.be/gdfQW02qb_U
	https://youtu.be/cXZc3ZIcnsU

Задание:
	1. В методических материалах ознакомится с темой списки, двусвязные списки и бинарное дерево

	2. Закончить пример очереди начатый в аудитории: реализовать функцию enqueue до конца,
           использовать динамический, а не статический массив.
	
	3. Изучить алгоритм решения задачи решения арифметического выражения
		https://habrahabr.ru/post/50196/

	Реализовать класс MathEval для решения арифметических выражений.
	Привести пример применения

class MathEval
{
	// объявление полей
public:
	MathEval(char* equation)
	{
		// ваш код
	}

	double eval()
	{
		// ваш код
	}
};

int main()
{
	
	MathEval m("3+4-6/2");
	cout << m.eval() << endl; // 4
   	return 0;
}


	4. Создать имитацию игры "однорукий бандит". Например,
при нажатии кнопки «Enter» происходит «вращение»
трех барабанов (естественно, количество вращений
каждого из них выбирается случайно), на которых изо-
бражены разные значки; и если выпадает определенная
комбинация, то игрок получает какой-то выигрыш.